rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
/**
  ******************************************************************************
  * @file    clockconfig.c
  * @author  Rainer
  * @brief   Several Clock Configurations with different sources, SYSCLK 
  *          frequencies and correct Vcore settings and NVM Wait states
  *
  *          Available configurations
  *          1a. MSI-Clock based with parameterized clk value between 100kHz
  *              and 24 MHz,                Vcore Range 2, 0-3 WS
  *          1b. MSI-Clock based with parameterized clk value between 100kHz
  *              and 48 MHz,                Vcore Range 1, 0-2 WS
  *          2.  HSE Bypass mode, 8MHz,     Range 2, 0 WS
  *              ( this is specially for Nucleo-Boards ) 
  *          3a. HSI based, 16MHz,          Range 2, 1 WS
  *          3b. HSI based, 16MHz,          Range 1, 0 WS
  *          4.  PLL/HSI based, 32-80 MHz,  Range 1, 1-4 WS
  *         
  * @note    In every configuration there are only identical clock values for
  *          all types of sore clocks ( SYSCLK, HCLK, APB1 and APB2 CLK ) 
  *
  ******************************************************************************
  * Coarse Performance estimation
  * MSI  2MHZ Clocks, Scale 3, 0WS :  63700 Increments per second
  * MSI  4MHZ Clocks, Scale 3, 0WS : 129200 Increments per second
  * HSE  8MHZ Clocks, Scale 2, 0WS : 248100 Increments per second
  * HSI 16MHZ Clocks, Scale 2, 1WS : 430300 Increments per second
  * HSI 16MHZ Clocks, Scale 1, 0WS : 498000 Increments per second
  * PLL 32MHZ Clocks, Scale 1, 0WS : 862200 Increments per second
  ******************************************************************************
  */


/** @addtogroup CLOCK_CONFIG
  * @{
  */

#include "stm32l4xx_hal.h"
#include "config/config.h"
#include "dev/devices.h"
#include "eeprom.h"
#include "system/clockconfig.h"
#include "system/timer_handler.h"

#if DEBUG_MODE > 0
    #include "debug_helper.h"
#endif

#if DEBUG_PROFILING > 0
    #include "system/profiling.h"
#endif

/* Can we use an LSE Clock */
#if defined(HW_HAS_LSE_CRYSTAL) || defined(HW_HAS_LSE_BYPASS)
    #define HW_HAS_LSE
#endif

/*
 *************************************************************************************
 * As in Stop2 mode the wakeup clock is either MSI or HSI, we have to safe 
 * all neccessary parameters to be able to restore the clock settings when
 * normal clock source is not HSI16 or MSI.
 * When normal clock source is HSI16 or MSI, the same clock is selected as wakeup
 * clock source and we can continue as before sleep without any reconfiguration
 * All the following variables are set in "System_Clock_Set"
 *************************************************************************************/

static uint32_t saved_mhz;                 /* The last selected PLL frequency        */
static bool saved_bSwitchOffMSI;           /* the last selected bSwitchOffMSI value  */
static void (*RestoreFn)( uint32_t, bool); /* the restore function to call           */
static bool bClockSettingVolatile;         /* true, if the clock settings will be    */
                                           /* lost in Stop mode                      */


/******************************************************************************
 * returns true, iff the clock configuration is volatile in STOP mode
 *****************************************************************************/
bool ClockMustReconfiguredAfterStop ( void )
{
    return bClockSettingVolatile;
}

/******************************************************************************
 * Call this function to reconfigure clock after STOP mode
 *****************************************************************************/
void ClockReconfigureAfterStop(void)
{
    /* Make sure, clock setting is volatile and restoreFn is set */
    assert(bClockSettingVolatile);
    assert(RestoreFn);
    RestoreFn( saved_mhz, saved_bSwitchOffMSI );
}

/*
 *******************************************************************************
 Flash wait states in dependency of Vcore and HCLK
 Wait states                            HCLK (MHz) 
 (WS)(LATENCY)               VCORE Range 1(1)   VCORE Range 2(2)
     0 WS (1 CPU cycles)         = 16                = 6
     1 WS (2 CPU cycles)         = 32                = 12
     2 WS (3 CPU cycles)         = 48                = 18
     3 WS (4 CPU cycles)         = 64                = 26
     4 WS (5 CPU cycles)         = 80                = 26
 maximum HCLK at Vcore Range 2 is 26 MHz!
 *******************************************************************************
 */
static uint32_t SystemClock_GetFlashLatency( uint8_t vrange, uint32_t khz )
{  
  uint32_t flash_latency;
  switch ( vrange ) {
    case 1:
          if ( khz > 80000 ) {
              Error_Handler(__FILE__, __LINE__); 
              flash_latency = FLASH_LATENCY_4;
          }
          if      ( khz > 64000 ) flash_latency = FLASH_LATENCY_4;
          else if ( khz > 48000 ) flash_latency = FLASH_LATENCY_3;
          else if ( khz > 32000 ) flash_latency = FLASH_LATENCY_2;
          else if ( khz > 16000 ) flash_latency = FLASH_LATENCY_1;
          else                    flash_latency = FLASH_LATENCY_0;
        break;
    case 2:
          if ( khz > 26000 ) {
              Error_Handler(__FILE__, __LINE__); 
              flash_latency = FLASH_LATENCY_4;
          }
          if      ( khz > 18000 ) flash_latency = FLASH_LATENCY_3;
          else if ( khz > 12000 ) flash_latency = FLASH_LATENCY_2;
          else if ( khz > 6000  ) flash_latency = FLASH_LATENCY_1;
          else                    flash_latency = FLASH_LATENCY_0;
        break;
     default:
        Error_Handler(__FILE__, __LINE__); 
        flash_latency = FLASH_LATENCY_4;
  }

  return flash_latency;
}


/* Public functions ---------------------------------------------------------*/

/**
  * @brief  System Clock Configuration on MSI-Base
  *         The system Clock is configured as follow : 
  *            System Clock source            = MSI
  *            SYSCLK(Hz)                     = 100kHz ... 48MHz, depending from range
  *            HCLK(Hz)                       = 100kHz ... 48MHz, depending from range
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            APB2 Prescaler                 = 1
  *            Flash Latency(WS)              = depending from SYSCLK
  *            Main regulator output voltage  = Range 2, preferred, Range 1 when SYSCLK > 26 Mhz
  * @param range - One of RCC_MSIRANGE0 ... RCC_MSIRANGE_11
  *            RCC_MSIRANGE_0: range 0 around 100 kHz, 0 WS, Vcore Range 2  
  *            RCC_MSIRANGE_1: range 1 around 200 kHz, 0 WS, Vcore Range 2  
  *            RCC_MSIRANGE_2: range 2 around 400 kHz, 0 WS, Vcore Range 2  
  *            RCC_MSIRANGE_3: range 3 around 800 kHz, 0 WS, Vcore Range 2  
  *            RCC_MSIRANGE_4: range 4 around 1 MHz, 0 WS, Vcore Range 2  
  *            RCC_MSIRANGE_5: range 5 around 2 MHz, 0 WS, Vcore Range 2  
  *            RCC_MSIRANGE_6: range 6 around 4 MHz, 0 WS, Vcore Range 2   (reset value)
  *            RCC_MSIRANGE_7: range 6 around 8 MHz, 1 WS, Vcore Range 2  
  *            RCC_MSIRANGE_8: range 6 around 16 MHz, 2 WS, Vcore Range 2  
  *            RCC_MSIRANGE_9: range 6 around 24 MHz, 3 WS, Vcore Range 2   
  *            RCC_MSIRANGE_10: range 6 around 32 MHz, 1 WS, Vcore Range 1, NOT ALLOWED HERE
  *            RCC_MSIRANGE_11: range 6 around 48 MHz, 2 WS  Vcore Range 1, NOT ALLOWED HERE
  * @retval None
  */
static void SystemClock_MSI_Vrange_2(uint32_t msi_range)
{
  uint32_t flash_latency=FLASH_LATENCY_0;

  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  
  /* Enable MSI Oscillator */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSIClockRange = msi_range;
  RCC_OscInitStruct.MSICalibrationValue=0x00;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }
  switch ( msi_range ) {
    case RCC_MSIRANGE_7: flash_latency=FLASH_LATENCY_1; break;
    case RCC_MSIRANGE_8: flash_latency=FLASH_LATENCY_2; break;
    case RCC_MSIRANGE_9: flash_latency=FLASH_LATENCY_3; break;
    case RCC_MSIRANGE_10:
    case RCC_MSIRANGE_11:
      Error_Handler(__FILE__, __LINE__);
      break;
  }
  /* Select MSI as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_MSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;  
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;  
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, flash_latency)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }
  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();
  
