rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
      /* Enable Power Control clock */
      __HAL_RCC_PWR_CLK_ENABLE();
  
      /* Select Voltage Scale2  */
      HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE2);
  
      /* Disable Power Control clock */
      __HAL_RCC_PWR_CLK_DISABLE();

      /* Disable MSI Oscillator, if desired */
      if ( bSwitchOffMSI ) {
        SwitchOffMSI();
        /* HSI16 as Wakeup clock */
        SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
      } else {
        /* MSI as Wakeup clock */
        CLEAR_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
      }
    }

    /*
     * The initialization part that has to be restored after wakeup from stop 
     * only available, if an HSE oscillator is euqipped
     */
    static void SystemClock_HSE_8MHz_Vrange_1_0WS_restore ( uint32_t xxmhz, bool bSwitchOffMSI)
    {
      RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

      UNUSED(xxmhz);
      SwitchOnHSE();

      RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
      RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
      HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0);
      if ( bSwitchOffMSI ) {
        SwitchOffMSI();
      }
    }

    /**
      * @brief  System Clock Configuration on 8MHz Clock input
      *         The system Clock is configured as follow : 
      *            System Clock source            = 8 MHz Signal at OSC_IN pin HSE Bypass mode 
      *            SYSCLK(Hz)                     = 8MHz
      *            HCLK(Hz)                       = 8MhZ
      *            AHB Prescaler                  = 1
      *            APB1 Prescaler                 = 1
      *            APB2 Prescaler                 = 1
      *            Flash Latency(WS)              = 0
      *            Main regulator output voltage  = Scale1 mode
      * @param  bSwitchOffMSI - Set to TRUE, if MSI Clock should be switched off. When going to sleep, MSI clock
      *         MUST be activated again, BEFORE going to sleep
      * @note only available, if HSE oscillator is euqipped
      * @retval None
      */
    static void SystemClock_HSE_8MHz_Vrange_1_0WS(bool bSwitchOffMSI)
    {
      RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
 
      SwitchOnHSE();
  
      /* Enable Power Control clock */
      __HAL_RCC_PWR_CLK_ENABLE();
  
      /* Select Voltage Scale1  */
      HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);
  
      /* Disable Power Control clock */
      __HAL_RCC_PWR_CLK_DISABLE();

      /* Select HSE as system clock source and configure the HCLK, PCLK1 and PCLK2 
         clocks dividers */
      RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
      RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
      RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
      RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;  
      RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
      if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0)!= HAL_OK)
      {
        /* Initialization Error */
        while(1); 
      }

      /* Disable MSI Oscillator, if desired */
      if ( bSwitchOffMSI ) {
        SwitchOffMSI();
        /* HSI16 as Wakeup clock */
        SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
      } else {
        /* MSI as Wakeup clock */
        CLEAR_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
      }
    }
    /**
      * @brief  Switch on LSE an select as system clock 
      *
      * @note Caller must assure, that core voltage and wait srtats are selected properly before!
      * 
      */
#endif

/**
  * @brief  System Clock Configuration on 16MhZ HSI with one NVM-Waitstate and PowerScale 2
  *         The system Clock is configured as follow : 
  *            System Clock source            = 16MHz HSI RC-oscillator
  *            SYSCLK(Hz)                     = 16MHz
  *            HCLK(Hz)                       = 16MhZ
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            APB2 Prescaler                 = 1
  *            Flash Latency(WS)              = 2
  *            Main regulator output voltage  = Scale2 mode
  *
  *         Alternatively, Voltage can be switched to Scale1, after that flash can operate with 0 WS
  * 
  * @param  bSwitchOffMSI - Set to TRUE, if MSI Clock should be switched off. When going to sleep, MSI clock
  *         MUST be activated again, BEFORE going to sleep
  * @retval None
  */

static void SystemClock_HSI_16MHz_Vrange_2_2WS(bool bSwitchOffMSI)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  
  /* Enable HSI RC-Oscillator */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT; 
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }
  
  /* Select HSI as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;  
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }

  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();
  
  /* Select Voltage Scale2  */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE2);
  
  /* Disable Power Control clock */
  __HAL_RCC_PWR_CLK_DISABLE();

  /* Disable MSI Oscillator, if desired */
  if ( bSwitchOffMSI ) {
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
    RCC_OscInitStruct.MSIState = RCC_MSI_OFF;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
    {
      /* Initialization Error */
      while(1); 
    }
  }
  /* Select HSI16 also as WakeUp clock */
  SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);

