rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
}

/**
  * @brief  Switch on HSI an select as system clock 
  *
  * @note Caller must assure, that core voltage and wait srtats are selected properly before!
  * 
  * allowed are - Vrange 1, min 0 flash WS
  *             - Vrange 2, min 2 flash WS
  *
  */
static void SC_SwitchOnHSI(void)
{
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};

    /* Enable HSI RC-Oscillator */
    RCC_OscInitStruct.OscillatorType        = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState              = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue   = RCC_HSICALIBRATION_DEFAULT; 
    RCC_OscInitStruct.PLL.PLLState          = RCC_PLL_NONE;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
    {
        /* Initialization Error */
        while(1); 
    }

    /* Select HSI as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
    RCC_ClkInitStruct.ClockType             = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
    RCC_ClkInitStruct.SYSCLKSource          = RCC_SYSCLKSOURCE_HSI;
    RCC_ClkInitStruct.AHBCLKDivider         = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider        = RCC_HCLK_DIV1;  
    RCC_ClkInitStruct.APB2CLKDivider        = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0)!= HAL_OK)
    {
        /* Initialization Error */
        while(1); 
    }
}

/**
  * @brief  System Clock Configuration on 16MhZ HSI with no NVM-Waitstates and Power Scale 1
  *         The system Clock is configured as follow : 
  *            System Clock source            = 16MHz HSI RC-oscillator
  *            SYSCLK(Hz)                     = 16MHz
  *            HCLK(Hz)                       = 16MhZ
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            APB2 Prescaler                 = 1
  *            Flash Latency(WS)              = 0
  *            Main regulator output voltage  = Scale1 mode
  *
  *         Alternatively, Voltage can be switched to Scale1, after that flash can operate with 0 WS
  * 
  * @param  bSwitchOffMSI - Set to TRUE, if MSI Clock should be switched off. When going to sleep, MSI clock
  *         MUST be activated again, BEFORE going to sleep
  * @retval None
  */

static void SystemClock_HSI_16MHz_Vrange_1_0WS(bool bSwitchOffMSI)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  
  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();
  
  /* Select Voltage Scale1  */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);
  
  /* Disable Power Control clock */
  __HAL_RCC_PWR_CLK_DISABLE();

  SC_SwitchOnHSI();

  /* Disable MSI Oscillator, if desired */
  if ( bSwitchOffMSI ) {
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
    RCC_OscInitStruct.MSIState = RCC_MSI_OFF;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
    {
      /* Initialization Error */
      while(1); 
    }
  }
  /* Select HSI16 also as WakeUp clock */
  SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
}


/******************************************************************************
 * configure PLL on HSI16 bas to xxmhz Mhz and stich on PLL
 *****************************************************************************/
static void SwitchOnPLL ( uint32_t xxmhz )
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};

  /* 
   * if PLL is already selected as system clock source, 
   * it must be disabled before reconfiguration 
   */
  if (  __HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_PLL ) {
    /* if so, select HSI as temporary system clock source       */
    /* Vrange and Wait states have been set by caller */
    SC_SwitchOnHSI();
  }

  /* if HSE oscillator is equipped, use as PLL input, otherwise use HSI16 */
  #if defined(PLL_INP_FRQ) 
    #undef PLL_INP_FRQ
  #endif

  #if defined(HW_HAS_LSE)
    SwitchOnHSE();
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    #define PLL_INP_FRQ  LSE_FREQUENCY
  #else
      RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
      RCC_OscInitStruct.HSIState = RCC_HSI_ON;
      RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT; 
      RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
      #define PLL_INP_FRQ 16000000
  #endif

  /* 
   * PLLN is computed so, that the output is at 8MHz,
   * check, whether this can be achieved
   */
  #define PLL_BASE_FRQ      8000000
  #define PLL_DIVM          (PLL_INP_FRQ/PLL_BASE_FRQ) 
  #if PLL_DIVM * PLL_BASE_FRQ != PLL_INP_FRQ
    #error "PLLM is not an integer value - cannot set PLLM"
  #endif  
  /* Enable  PLL */
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;   
  RCC_OscInitStruct.PLL.PLLM = PLL_DIVM;
  RCC_OscInitStruct.PLL.PLLN = xxmhz / 2 ;
  RCC_OscInitStruct.PLL.PLLR = 4;
  RCC_OscInitStruct.PLL.PLLP = 17;
  RCC_OscInitStruct.PLL.PLLQ = 8;
   
   if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }
}

/*
 * The initialization part that has to be restored after wakeup from stop 
 */
static void SystemClock_PLL_xxMHz_Vrange_1_restore (uint32_t xxmhz, bool bSwitchOffMSI)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
 
  uint32_t flash_latency = SystemClock_GetFlashLatency(1, xxmhz * 1000);
  SwitchOnPLL(xxmhz);
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, flash_latency );
  if ( bSwitchOffMSI ) {
    SwitchOffMSI();
  }
}

/**
  * @brief  System Clock Configuration on 32MhZ PLL-Clock, basing on 16MhZ HSI
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL Clock
  *            PLL input                      = 16MHz HSI RC-oscillator
  *            SYSCLK(Hz)                     = as desired, between 16 and 80 MHz
  *            HCLK(Hz)                       = as desired, between 16 and 80 MHz
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            APB2 Prescaler                 = 1
  *            Flash Latency(WS)              = depending from xxmhz, between 0 and 4
  *            Main regulator output voltage  = Scale1 mode
  *
  * 
  * @param  bSwitchOffMSI - Set to TRUE, if MSI Clock should be switched off. When going to sleep, MSI clock
  *         MUST be activated again, BEFORE going to sleep
  * @retval None
  */

static void SystemClock_PLL_xxMHz_Vrange_1(uint32_t xxmhz, bool bSwitchOffMSI)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

