rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
  uint32_t flash_latency = SystemClock_GetFlashLatency(1, xxmhz * 1000);

  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();
  
  /* Select Voltage Scale1  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  
  /* Disable Power Control clock */
  __HAL_RCC_PWR_CLK_DISABLE();

  SwitchOnPLL(xxmhz);
  
  /* Select Pll as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;  
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, flash_latency )!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }

  /* Disable MSI Oscillator, if desired */
  if ( bSwitchOffMSI ) {
    SwitchOffMSI();
  }

  /* Select HSI16 also as WakeUp clock */
  SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
}

/* Only use "SystemClock_SetConfiguredClock" to change system clock            */
/* THis will ensure, that all devices will be noticed about clock              */
/* changes                                                                     */
/*******************************************************************************
 * Do all the clock setting on a configuration byte basis
 *******************************************************************************/
void SystemClock_Set(CLK_CONFIG_T clk_config_byte, bool bSwitchOffMSI )
{
    /* Save desired settings for restoration after Stop */
    saved_bSwitchOffMSI   = bSwitchOffMSI;

    /* 
     * Initially assunm, that there is no restoration needed
     * In general, all clock settings on basis of HSI16 or MSI are non volatile
     * and do not need a restoration, whereas all other clock settings 
     * ( eg. HSE or PLL are volatile and need a restauration 
     */
    bClockSettingVolatile = false;         
    RestoreFn             = NULL;

    switch ( clk_config_byte ) {
        case CLK_MSI_VRNG1_08MHZ_0WS:
            SystemClock_MSI_Vrange_1(RCC_MSIRANGE_7);
            break;
        case CLK_MSI_VRNG2_08MHZ_1WS:
            SystemClock_MSI_Vrange_2(RCC_MSIRANGE_7);
            break;
        case CLK_HSE_VRNG1_08MHZ_0WS:
            #if defined(HW_HAS_LSE)
                bClockSettingVolatile   = true; 
                RestoreFn               = SystemClock_HSE_8MHz_Vrange_1_0WS_restore;
                SystemClock_HSE_8MHz_Vrange_1_0WS(bSwitchOffMSI);
            #else
                DEBUG_PRINTF("Clock option not avialable - No LSE oscillator equipped");
            #endif
            break;
        case CLK_HSE_VRNG2_08MHZ_1WS:
            #if defined(HW_HAS_LSE)
                bClockSettingVolatile   = true;         
                RestoreFn               = SystemClock_HSE_8MHz_Vrange_2_1WS_restore;
                SystemClock_HSE_8MHz_Vrange_2_1WS(bSwitchOffMSI);
            #else
                DEBUG_PRINTF("Clock option not avialable - No LSE oscillator equipped");
            #endif
            break;
        case CLK_HSI_VRNG1_16MHZ_0WS:
            SystemClock_HSI_16MHz_Vrange_1_0WS(bSwitchOffMSI);
            break;
        case CLK_HSI_VRNG2_16MHZ_2WS:
            SystemClock_HSI_16MHz_Vrange_2_2WS(bSwitchOffMSI);
            break;
        case CLK_MSI_VRNG1_16MHZ_0WS:
            SystemClock_MSI_Vrange_1(RCC_MSIRANGE_8);
            break;
        case CLK_MSI_VRNG2_16MHZ_2WS:
            SystemClock_MSI_Vrange_2(RCC_MSIRANGE_8);
            break;
        case CLK_MSI_VRNG1_24MHZ_1WS:
            #if defined(HW_HAS_LSE)
                bClockSettingVolatile = true;         
                saved_mhz             = 24;
                RestoreFn             = SystemClock_PLL_xxMHz_Vrange_1_restore;
                SystemClock_PLL_xxMHz_Vrange_1(24, bSwitchOffMSI);
            #else
                SystemClock_MSI_Vrange_1(RCC_MSIRANGE_9);
            #endif
            break;
        case CLK_MSI_VRNG2_24MHZ_3WS:
            SystemClock_MSI_Vrange_2(RCC_MSIRANGE_9);
            break;
        case CLK_MSI_VRNG1_32MHZ_1WS:
            #if defined(HW_HAS_LSE)
                bClockSettingVolatile = true;         
                saved_mhz             = 32;
                RestoreFn             = SystemClock_PLL_xxMHz_Vrange_1_restore;
                SystemClock_PLL_xxMHz_Vrange_1(32, bSwitchOffMSI);
            #else
                SystemClock_MSI_Vrange_1(RCC_MSIRANGE_10);
            #endif
            break;
        case CLK_MSI_VRNG1_48MHZ_2WS:
            #if defined(HW_HAS_LSE)
                bClockSettingVolatile = true;         
                saved_mhz             = 48;
                RestoreFn             = SystemClock_PLL_xxMHz_Vrange_1_restore;
                SystemClock_PLL_xxMHz_Vrange_1(48, bSwitchOffMSI);
            #else
                SystemClock_MSI_Vrange_1(RCC_MSIRANGE_11);
            #endif
            break;
        case CLK_PLL_VRNG1_64MHZ_3WS:
            bClockSettingVolatile = true;         
            saved_mhz             = 64;
            RestoreFn             = SystemClock_PLL_xxMHz_Vrange_1_restore;
            SystemClock_PLL_xxMHz_Vrange_1(64, bSwitchOffMSI);
            break;
        case CLK_PLL_VRNG1_80MHZ_4WS:
            bClockSettingVolatile = true;         
            saved_mhz             = 80;
            RestoreFn             = SystemClock_PLL_xxMHz_Vrange_1_restore;
            SystemClock_PLL_xxMHz_Vrange_1(80, bSwitchOffMSI);
            break;
    } // Case

    /* Notice all devices about frequency change                             */
    /* Momentarily, the frq change is not reverted, if any device refuses to */
    /* change frq. this has to be changed for correct implementation         */
    /* Eg by asking before frq change takes place                            */
    if ( DevicesInhibitFrqChange() ) {
        #if DEBUG_MODE > 0
            DEBUG_PUTS("ERR: One or more devices did not agree to new frequency!");
        #endif
    }

    #if DEBUG_MODE > 0
        DEBUG_PRINTF("SYSCLK nom. %d\n", HAL_RCC_GetSysClockFreq());
        DEBUG_PRINTF("SYSCLK real  %d\n",Get_SysClockFrequency());
    #endif
}

