rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
/******************************************************************************
 * Set the system clock configuration as configured in config-variable
 *****************************************************************************/
void SystemClock_SetConfiguredClock(void)
{
  // Set clcock configuration, switch MSI off, if no more used
  SystemClock_Set(config.clk_config, true );
}

void LSEClockConfig(bool bLSEon, bool bUseAsRTCClock)
{
  RCC_OscInitTypeDef        RCC_OscInitStruct;
  RCC_PeriphCLKInitTypeDef  PeriphClkInitStruct;
  
  /* Enable the PWR Clock and Enable access to the backup domain */
  __HAL_RCC_PWR_CLK_ENABLE();
  HAL_PWR_EnableBkUpAccess();

  /*Switch LSE on or OFF */
  RCC_OscInitStruct.OscillatorType =  RCC_OSCILLATORTYPE_LSE;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.LSEState = bLSEon ? RCC_LSE_ON : RCC_LSE_OFF;
  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
      Error_Handler(__FILE__, __LINE__);
  
  /* Set to lowest driving strngth */
  __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);
 
  /* Set LSE as RTC clock source, if desired */
  if ( bUseAsRTCClock )  {
      PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC;
      PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
      if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
          Error_Handler(__FILE__, __LINE__);
  }

  /* IF MSI is running, set the MSIPLL bit for automatic synchronization of MSI to LSE clock */
  if ( RCC->CR & RCC_CR_MSION ) {
    SET_BIT(RCC->CR, RCC_CR_MSIPLLEN );
  }
   
  /*Disable Backup Access and PWR Clock */ 
  HAL_PWR_DisableBkUpAccess();
  __HAL_RCC_PWR_CLK_DISABLE(); 
}

void HSIClockConfig(bool bHSIon)
{
  RCC_OscInitTypeDef        RCC_OscInitStruct;
  
  /*Switch HSI on or OFF */
  RCC_OscInitStruct.OscillatorType =  RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
   RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;            /* Reset value */
  RCC_OscInitStruct.HSIState = bHSIon ? RCC_HSI_ON : RCC_HSI_OFF;
  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
      Error_Handler(__FILE__, __LINE__);
  
  /* Set HSI Autostart from Stop mode */
  RCC->CR |= RCC_CR_HSIASFS;
}


/******************************************************************************
 * Do a Calibration of the HSI16 clock 
 * To do this, the LSE clock has to be on. SYSCLK will be switched to
 * HSI16 temporarily
 * TMR15 is used to perform the calibration
 *****************************************************************************/

#include "debug_helper.h"

#define __TIMx_CLK_ENABLE()        __HAL_RCC_TIM15_CLK_ENABLE()
#define __TIMx_CLK_DISABLE()       __HAL_RCC_TIM15_CLK_DISABLE()
#define  TIMx                       TIM15
#define  TIM_CHANNEL_y              TIM_CHANNEL_1
#define  HAL_TIM_ACTIVE_CHANNEL_y   HAL_TIM_ACTIVE_CHANNEL_1
#define  TIM_TIMx_GPIO              TIM_TIM15_TI1_GPIO
#define  TIM_TIMx_LSE               TIM_TIM15_TI1_LSE
#define  TIMx_IRQn                  TIM1_BRK_TIM15_IRQn

#define CAPTURE_START              ((uint32_t) 0x00000001)
#define CAPTURE_ONGOING            ((uint32_t) 0x00000002)
#define CAPTURE_COMPLETED          ((uint32_t) 0x00000003)

/* No timer input prescaler */
#define HSI_TIMx_COUNTER_PRESCALER   ((uint32_t)0)
/* The signal in input capture is divided by 8 */
#define HSI_TIMx_IC_DIVIDER          TIM_ICPSC_DIV8

/* The LSE is divided by 8 => LSE/8 = 32768/8 = 4096 */
#define REFERENCE_FREQUENCY         ((uint32_t)4096) /*!< The reference frequency value in Hz */

/* Timeout to avoid endless loop */
#define HSI_TIMEOUT                    ((uint32_t)0xFFFFFF)

/* Number of measurements in the loop */
#define HSI_NUMBER_OF_LOOPS            ((uint32_t)10)

#define INITIAL_ERROR              ((uint32_t)99999000)

TIM_HandleTypeDef  TimHandle; /* Timer handler declaration */
uint32_t __IO       CaptureState;
uint32_t __IO       Capture;
uint32_t            StartCalibration;
uint32_t            IC1ReadValue1 = 0, IC1ReadValue2 = 0;
/* Exported macro ------------------------------------------------------------*/
#define __HAL_GET_TIM_PRESCALER(__HANDLE__)       ((__HANDLE__)->Instance->PSC)
#define ABS_RETURN(x)                             (((x) < 0) ? -(x) : (x))
#define __HAL_GET_HSI_CALIBRATIONVALUE() \
                  ((RCC->ICSCR & RCC_ICSCR_HSITRIM_Msk) >> RCC_ICSCR_HSITRIM_Pos)

/******************************************************************************
  * @brief  This function handles TIM15 interrupt request 
  * (for HSI16 calibration).
  * @param  None
  * @retval None
  ****************************************************************************/
void TIM1_BRK_TIM15_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&TimHandle);
}

/******************************************************************************
  * @brief  Conversion complete callback in non blocking mode
  * @param  htim : hadc handle
  * @retval None
  ****************************************************************************/
void TimerCaptureCallback(TIM_HandleTypeDef *htim)
{

  if ((htim->Channel) == HAL_TIM_ACTIVE_CHANNEL_y)
  {
    if (CaptureState == CAPTURE_START)
    {
      /* Get the 1st Input Capture value */
      IC1ReadValue1 = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_y);
      CaptureState = CAPTURE_ONGOING;
    }
    else if (CaptureState == CAPTURE_ONGOING)
    {
      /* Get the 2nd Input Capture value */
      IC1ReadValue2 = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_y);

      /* Capture computation */
      if (IC1ReadValue2 > IC1ReadValue1)
      {
        Capture = (IC1ReadValue2 - IC1ReadValue1);
      }
      else if (IC1ReadValue2 < IC1ReadValue1)
      {
        Capture = ((0xFFFF - IC1ReadValue1) + IC1ReadValue2);
      }
      else
      {
        /* If capture values are equal, we have reached the limit of frequency
        measures */
        Error_Handler(__FILE__, __LINE__);
      }

      CaptureState = CAPTURE_COMPLETED;
    }
  }
}

#if 0
void HAL_TIMEx_BreakCallback(TIM_HandleTypeDef *htim)
{
    UNUSED(htim);
    Error_Handler(__FILE__, __LINE__);
}
void HAL_TIMEx_Break2Callback(TIM_HandleTypeDef *htim)
{
    UNUSED(htim);
    Error_Handler(__FILE__, __LINE__);
}
void HAL_TIMEx_CommutCallback(TIM_HandleTypeDef *htim)
{
    UNUSED(htim);
    Error_Handler(__FILE__, __LINE__);
}
#endif

