rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
/******************************************************************************
  * @brief Measures actual value of HSI
  * @param  None.
  * @retval Actual HSI frequency
  ****************************************************************************/
uint32_t HSI_FreqMeasure(void)
{
  uint32_t  measured_frequency;
  uint32_t  loop_counter = 0;
  uint32_t  timeout = HSI_TIMEOUT;

  /* Start frequency measurement for current trimming value */
  measured_frequency = 0;
  loop_counter = 0;
  /* Start measuring Internal Oscillator frequency */
  while (loop_counter <= HSI_NUMBER_OF_LOOPS)
  {
    CaptureState = CAPTURE_START;

    /* Enable capture 1 interrupt */
    HAL_TIM_IC_Start_IT(&TimHandle, TIM_CHANNEL_y);

    /* Enable the TIMx IRQ channel */
    HAL_NVIC_EnableIRQ(TIMx_IRQn);

    /* Wait for end of capture: two consecutive captures */
    while ((CaptureState != CAPTURE_COMPLETED) && (timeout != 0))
    {
      if (--timeout == 0)
      {
        return ERROR;
      }
    }

    /* Disable IRQ channel */
    HAL_NVIC_DisableIRQ(TIMx_IRQn);

    /* Disable TIMx */
    HAL_TIM_IC_Stop_IT(&TimHandle, TIM_CHANNEL_y);

    if (loop_counter != 0)
    {
      /* Compute the frequency (the Timer prescaler isn't included) */
      measured_frequency += (uint32_t) (REFERENCE_FREQUENCY * Capture);
    }

    /* Increment loop counter */
    loop_counter++;
  }
  /* END of Measurement */

  /* Compute the average value corresponding the current trimming value */
  measured_frequency = (uint32_t)((__HAL_GET_TIM_PRESCALER(&TimHandle) + 1) * (measured_frequency / HSI_NUMBER_OF_LOOPS));
  return measured_frequency;
}


/**
  * @brief  Calibrates internal oscillators HSI to the minimum computed error.
  *         The system clock source is checked:
  *           - If HSI oscillator is used as system clock source, HSI is calibrated
  *             and the new HSI value is returned.
  *           - Otherwise function returns 0.
  * @param  None.
  * @retval The optimum computed frequency of HSI oscillator.
  *         Returning 0 means that the system clock source is not HSI.
  */
uint32_t HSI_CalibrateMinError(void)
{
  uint32_t  measured_frequency = 0;
  uint32_t  sys_clock_frequency = 0;
  uint32_t  optimum_frequency = 0;
  uint32_t  frequency_error = 0;
  uint32_t  optimum_frequency_error = INITIAL_ERROR; /* Large value */
  uint32_t  steps_number = 0;         /* Number of steps: size of trimming bits */
  uint32_t  trimming_value = 0;
  uint32_t  optimum_calibration_value = 0;
  uint32_t  calibrated_frequency = 0;

  /* Get system clock frequency */
  sys_clock_frequency = HAL_RCC_GetSysClockFreq();

  if (StartCalibration != 0)
  {
    /* 
     * HSI16TRIM is 5-bit or 7 bits ( on SXM32L49x ) wide. The Calibration default value from 
     * HAL driver is the mid value in that range. So the total number of possible steps is
     * twice the calibration default value 
     */
    steps_number = RCC_HSICALIBRATION_DEFAULT * 2; /* number of steps is twice the default value */
  }
  else
  {
    /* Without Calibration */
    steps_number = 1;
  }

  /* Internal Osc frequency measurement for steps_number */
  for (trimming_value = 0; trimming_value < steps_number; trimming_value++)
  {
    if (StartCalibration != 0)
    {
      /* Set the Intern Osc trimming bits to trimming_value */
      __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(trimming_value);
    }

    /* Get actual frequency value */
    measured_frequency = HSI_FreqMeasure();

    if (StartCalibration != 0)
    {
      /* Compute current frequency error corresponding to the current trimming value:
      measured value is subtracted from the typical one */
      frequency_error = ABS_RETURN((int32_t) (measured_frequency - sys_clock_frequency));

      /* Get the nearest frequency value to typical one */
      if (optimum_frequency_error > frequency_error)
      {
        optimum_frequency_error = frequency_error;
        optimum_calibration_value = trimming_value;
        optimum_frequency = measured_frequency;
      }
    }
  }

  if (StartCalibration != 0)
  {
    /* Set trimming bits corresponding to the nearest frequency */
    __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(optimum_calibration_value);
    /* Return the intern oscillator frequency after calibration */
    calibrated_frequency = optimum_frequency;
  }
  else
  {
    /* Return the intern oscillator frequency before calibration */
    calibrated_frequency = measured_frequency;
  }

  return calibrated_frequency;
}

/******************************************************************************
  * @brief Configures the TIMx in input capture to measure HSI frequency.
  * @param  None.
  * @retval None.
  ****************************************************************************/
static void HSI_TIMx_ConfigForCalibration(void)
{
  TIM_IC_InitTypeDef      ic_config; /* Timer Input Capture Configuration Structure declaration */

  /* Enable TIMx clock */
  __TIMx_CLK_ENABLE();

  /* Set TIMx instance */
  TimHandle.Instance = TIMx;

  /* Reset TIMx registers */
  HAL_TIM_IC_DeInit(&TimHandle);

    /* Connect LSE clock to TIMx Input Capture 1 */
    HAL_TIMEx_RemapConfig(&TimHandle, TIM_TIMx_LSE);     

  /* Initialize TIMx peripheral as follows:
       + Period = 0xFFFF
       + Prescaler = 0
       + ClockDivision = 0
       + Counter direction = Up
  */
  TimHandle.Init.Period            = 0xFFFF;
  TimHandle.Init.Prescaler         = HSI_TIMx_COUNTER_PRESCALER;
  TimHandle.Init.ClockDivision     = 0;
  TimHandle.Init.CounterMode       = TIM_COUNTERMODE_UP;
  TimHandle.Init.RepetitionCounter = 0;
  if (HAL_TIM_IC_Init(&TimHandle) != HAL_OK)
  {
    /* Initialization Error */
    Error_Handler(__FILE__, __LINE__);
  }

  /* Register capture Callback */
  Tim_Register_CaptureCB(TimHandle.Instance, TimerCaptureCallback);

  /* Configure the Input Capture of channel y */
  ic_config.ICPolarity  = TIM_ICPOLARITY_RISING;
  ic_config.ICSelection = TIM_ICSELECTION_DIRECTTI;
  ic_config.ICPrescaler = HSI_TIMx_IC_DIVIDER;
  ic_config.ICFilter    = 0;
  if (HAL_TIM_IC_ConfigChannel(&TimHandle, &ic_config, TIM_CHANNEL_y) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler(__FILE__, __LINE__);
  }

