rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
  /* Configure the NVIC for TIMx */
  HAL_NVIC_SetPriority(TIMx_IRQn, 0, 1);

  /* Disable the TIMx global Interrupt */
  HAL_NVIC_DisableIRQ(TIMx_IRQn);

}
/******************************************************************************
  * @brief DeInitializes TIMx
  * @param  None.
  * @retval None.
  ****************************************************************************/
static void HSI_TIMx_DeInit(void)
{

  /* Disable the TIMx global Interrupt */
  HAL_NVIC_DisableIRQ(TIMx_IRQn);

  /* Set TIMx instance */
  TimHandle.Instance = TIMx;

  /* UnRegister capture Callback */
  Tim_UnRegister_CaptureCB(TimHandle.Instance);

  /* Reset TIMx registers */
  HAL_TIM_IC_DeInit(&TimHandle);

  /* Disable TIMx clock */
  __TIMx_CLK_DISABLE();


}



bool HSIClockCalibrate ( void )
{
    /* check for LSE being on and ready */
    if ( (RCC->BDCR & ( RCC_BDCR_LSEON_Msk | RCC_BDCR_LSERDY_Msk ) ) != ( RCC_BDCR_LSEON_Msk | RCC_BDCR_LSERDY_Msk ) ) 
      return false;

    /* switch to HSI16, Vrange1, 0 WS*/
    SystemClock_Set(CLK_HSI_VRNG1_16MHZ_0WS, false); 

    /* Prepare TIM15 for calibration */
    HSI_TIMx_ConfigForCalibration();


    uint32_t old_freq = HSI_FreqMeasure();
    uint8_t old_trim = __HAL_GET_HSI_CALIBRATIONVALUE();

    /* Do the calibration */
    StartCalibration = 1;
    uint32_t act_freq = HSI_CalibrateMinError();

    /* DeInit all the timer stuff */
    HSI_TIMx_DeInit();

    /* Switch back to default clock source */
    SystemClock_SetConfiguredClock();

    DEBUG_PUTS("Performing HSI16 Calibration");
    DEBUG_PRINTF("HSI-Cal before=%d, Freq=%d\n", old_trim, old_freq);
    DEBUG_PRINTF("HSI-Cal  after=%d, Freq=%d\n", __HAL_GET_HSI_CALIBRATIONVALUE(), act_freq);

    return true;
}

uint32_t Get_SysClockFrequency ( void )
{
    /* check for LSE being on and ready */
    if ( (RCC->BDCR & ( RCC_BDCR_LSEON_Msk | RCC_BDCR_LSERDY_Msk ) ) != ( RCC_BDCR_LSEON_Msk | RCC_BDCR_LSERDY_Msk ) ) 
      return 0;

    /* Prepare TIM15 for calibration */
    HSI_TIMx_ConfigForCalibration();


    uint32_t _freq = HSI_FreqMeasure();

    /* DeInit all the timer stuff */
    HSI_TIMx_DeInit();

    return _freq;
}

/******************************************************************************
 * enable the MCO output at PA8. Output clock is undivided.
 * The MCO source can be selected by parameter
 * 0 - Off & DeInit PA8
 * 1 - SYSCLK
 * 2 - MSI
 * 3 = HSI
 * 4 = HSE
 * 5 = PLL
 * 6 = LSE
 * 7 = LSI
 *****************************************************************************/
void EnableMCO ( uint32_t mcoSource )
{
    uint32_t halParam;
    switch ( mcoSource ) {
        case 1: halParam = RCC_MCO1SOURCE_SYSCLK; break;
        case 2: halParam = RCC_MCO1SOURCE_MSI; break;
        case 3: halParam = RCC_MCO1SOURCE_HSI; break;
        case 4: halParam = RCC_MCO1SOURCE_HSE; break;
        case 5: halParam = RCC_MCO1SOURCE_PLLCLK; break;
        case 6: halParam = RCC_MCO1SOURCE_LSE; break;
        case 7: halParam = RCC_MCO1SOURCE_LSI; break;
        default:
            halParam = RCC_MCO1SOURCE_NOCLOCK;
    }
    HAL_RCC_MCOConfig(RCC_MCO1, halParam, RCC_MCODIV_1);
    if ( halParam == RCC_MCO1SOURCE_NOCLOCK ) {
        HAL_GPIO_DeInit(GPIOA, GPIO_PIN_8);
    }
}

/**
  * @}
  */


